<?php
    return array(
        I_TITLE => 'القسم',
        I_SWEAR => 'اقسم،',
        I_INTRO => 'للوفاء وفق أفضل ما لدي من *القدرة* و *الحكم*

                    على هذا القسم وهذا العهد',
        I_OATH  => array(
            'أني سوف احترم *معرفة* الناس الذين على خطاهم امشي (وأولئك الذين يعلموني و يساعدوني، و سوف اقوم بمشاركة هذه المعرفة مع من يأتي من بعدي، كما فعل اخرون معي، و سوف اتذكر ان *المعرفة لا ينبغي لها أن تكون سرية* للراغبين في التعلم.)',
            'أني سوف استخدم التكنولوجيا *للخير* ( و *لتقدم* البشرية، وأن تكون خالية من الشر،
            و من أجل تحسين حياة الناس.)',
            'أني لن استخدم معرفتي للربح الغير عادل( سواءً كان ماديا ام لا، ولن ادعي أن استخدام التكنولوجيا أمراً ضرورياً عندما لا يكون، ولكني سوف استخدمها من اجل حل المشاكل *الحقيقية* فقط و من دون الظلم المتعمد.)',
            'أني سوف اتذكر أن التكنولوجيا *ستتحسن* دائماً(وأني لن اتوقف عن التعلم ابدا، وأن الهدف من حياتي هو *تحسين الذات* باستمرار.)',
            'أني سوف اتذكر أن هندسة البرمجيات والتكنولجيا عبارة عن *فن*،(وأن هناك متعة بالبرمجة، وأني لن انسى ان البرامج يجب ان تكتب حتى يقرءها *الناس*، وأنها واقعة على الآلات لتقوم بتنفيذها.)',
            'أني سوف اتذكر أن أساس التكنولوجيا هو *العلوم* (وسوف لن انسى كيف ساهم هؤلاء العلماء ودعموا فني؛ هؤلاء الذين طوروا الرياضيات والفيزياء والكيمياء وعلم الحساب.)',
            'أني لن أخجل في قول "لا أعرف" (ولن افشل في طلب المساعدة من مهندسٌ آخر اذا ادعت الحاجة.)',
            'عندما وعن طريق التكنولوجيا استطيع الوصول الى بيانات خاصة، سوف احترم *الخصوصية*(ولن أقوم باسأة استعمال المعلومات التي بين يدي.)',
            'أني سوف أتذكر كمهندس أن بجانب قدراتي وقوتي يأتي *التزامي*(في تحسين حياة زملائي البشر.)'
        ),
        I_CC => 'Creative Commons License',
        I_EPILOGUE0 => 'اذا لم اخن هذا الميثاق،

                        فليكن لي الحق في الاستمتاع *بالحياة* و *الفن*،

                        *أُحترم* ما حييت

                        وأذكر *بالمودة* بعدئذ.',
        I_EPILOGUE1 => 'فليكن لي القيام بالحفاظ على *خيرة تقاليد* دعوتي

                        وليكن لي متعة *الابتكار* لفترة طويلة الأمد.

                        ليكن لي *متعة* تقديم عناصر جديدة لفني

                        حتى *يتقدم*.',
        I_TAKE      => 'أدي اليميين',
        I_SHARE_FB  => 'أنشرها على فيس بوك',
        I_SHARE_TW  => 'أنشرها على Twitter'
    );
?>
