<?php
    return array(
        I_TITLE => 'Όρκος',
        I_SWEAR => 'Ορκίζομαι,',
        I_INTRO => 'στην *τιμή* και την *υπόληψή* μου να πράξω,

                    όσο καλύτερα μπορώ σύμφωνα με την

                    *ικανότητα* και την *κρίση* μου, τα ακόλουθα:',
        I_OATH  => array(
            'Θα σέβομαι τη *γνώση* των ανθρώπων των οποίων τα βήματα ακολουθώ( και εκείνους που με διδάσκουν και με
            βοηθούν, και ευχαρίστως θα μοιράζομαι αυτή τη γνώση με εκείνους που θα ακολουθήσουν, όπως τη γνώση μοιράστηκαν άλλοι
            μαζί μου. Θα θυμάμαι ότι *η γνώση δεν πρέπει να κρατιέται μυστική* για όσους θέλουν να μάθουν.)',
            'Θα χρησιμοποιώ την τεχνολογία για το καλό( και την πρόοδο της ανθρωπότητας, χωρίς κακό σκοπό, με στόχο την καλυτέρευση της ζωής των ανθρώπων.'),
            'Δεν θα χρησιμοποιώ τις γνώσεις μου για άδικο κέρδος(, χρηματικό ή άλλου είδους. Δεν θα υποστηρίζω ότι είναι απαραίτητη
            η χρήση τεχνολογίας εκεί που δεν χρειάζεται, αλλά μόνο για την επίλυση *υπαρκτών* προβλημάτων.)',
            'Θα θυμάμαι ότι η τεχνολογία *βελτιώνεται* πάντα(, και δε θα σταματήσω να μαθαίνω ποτέ, και στόχος στη ζωή μου 
            θα είναι η συνεχής *αυτοβελτίωση*.)',
            'Θα θυμάμαι ότι η ανάπτυξη λογισμικού είναι εκτός από τεχνολογία και *τέχνη*(, και ότι υπάρχει ομορφιά στον κώδικα. Δεν
            θα ξεχνώ ότι τα προγράμματα θα πρέπει να γράφονται για να τα διαβάζουν *άνθρωποι*, και μόνο δευτερευόντως για να τα 
            εκτελούν οι μηχανές.)',
            'Θα θυμάμαι ότι η τεχνολογία στηρίζεται στην *επιστήμη*(, και δεν θα ξεχνώ τη συμβολή των επιστημόνων που στήριξαν την
            τέχνη μου· εκείνους που ανέπτυξαν τα μαθηματικά, τη φυσική, τη χημεία και την επιστήμη των υπολογιστών.)',
            'Δεν θα ντρέπομαι να λέω "δεν ξέρω"( και ούτε θα φοβάμαι να ζητήσω τη βοήθεια κάποιου άλλου μηχανικού αν τη χρειαστώ.)',
            'Όταν μέσω της τεχνολογίας έχω πρόσβαση σε προσωπικά δεδομένα, θα σέβομαι την *ιδιωτικότητα*(
και δεν θα κάνω κατάχρηση των πληροφοριών στις οποίες έχω πρόσβαση.)',
            'Θα θυμάμαι ότι ως μηχανικός με τις ικανότητες και τη δύναμη που έχω, ταυτόχρονα έρχεται και η *υποχρέωση*( απέναντι 
στους συνανθρώπους μου να *δημιουργώ* και να κάνω τη ζωή τους καλύτερη.)'
        ),
        I_CC => 'Άδεια Creative Commons',
        I_EPILOGUE0 => 'Αν δεν παραβώ τούτο τον όρκο,

                        ας απολαμβάνω τη *ζωή* και την *τέχνη* μου,

                        κι ας με *σέβονται* όσο ζω

                        κι ας με θυμούνται με *αγάπη* μετέπειτα.',
        I_EPILOGUE1 => 'Ας διατηρώ τις *καλές παραδόσεις* της τέχνης μου

                        κι ας απολαμβάνω την δημιουργία *καινοτομίας*.

                        Κι ας έχω τη *χαρά* να προσφέρω στην τέχνη μου

                        νέα στοιχεία και να την κάνω να *προοδεύει*.',
        I_TAKE      => 'Ορκίζομαι',
        I_SHARE_FB  => 'Μοιράσου στο Facebook',
        I_SHARE_TW  => 'Μοιράσου στο Twitter'
    );
?>
