<?php
    return array(
        I_TITLE => 'शपथ',
        I_SWEAR => 'मै प्रण करता  हूं,',
        I_INTRO => 'की अपनी पूरी 
        
				          *क्षमता* और *निर्णय -शक्ति * के साथ,
                    
				          इस  शपथ को पूर्ण करूँगा ',
        I_OATH  => array(
            'मैं उन लोगों के *ज्ञान* का सम्मान करूँगा, जिनके पथ पर मुझे चलना है  (और  जो मेरी सहायता करते हैं और मुझे शिक्षा देतें हैं, और  उनके साथ इस ज्ञान को सहर्ष  साझा करूँगा जिन्हें इस पथ पर चलना है, जैसे की दूसरों ने मेरे साथ साझा किया है . मैं स्मरण करूंगा की
			*ज्ञान  गोपनीयता की वस्तु नहीं है * उनके लिए जो इसे प्राप्त करना चाहते है .)',
            'मैं प्रौद्योगिकी का उपयोग *भलाई * के लिए करूँगा (,और मानवता के विकास, बुराई से मुक्ति, और लोगों के जीवन की बेहतरी के लिए  करूँगा .)',
            'मैं अपने ज्ञान  का उपयोग अनुचित लाभ के लिए नहीं करूँगा (,वितीय  या  अन्य . मै कभी दावा नहीं करूँगा की प्रोद्योगिकी का  उपयोग अनावश्यक रूप से करना चाहिए , अपितु  *वास्तविक* समस्याओं का हल  खोजने  के लिए इसका का इस्तेमाल होना चाहिए  , सभी प्रकार के जानबूझ कर किये गए अन्याय से मुक्त.)',
            'मैं  सदैव याद रखूँगा की प्रद्योगिकी  हमेशा  *विकसित* होती रहती है (, और मैं कभी  शिक्षा का त्याग नहीं करूँगा , और *स्व-विकास* सदैव मेरे जीवन का ध्येय रहेगा.)',
            'मैं सदैव स्मरण करूंगा की सॉफ्टवेर-अभियांत्रिकी एवं प्रोद्योगिकी एक कला है  (, और कोड में सुन्दरता है.  मैं कभी नहीं भूलूंगा की प्रोग्राम हमेशा इंसानों के पठन के लिए लिखे जाते है, और  यह एक संयोग है की वे  यंत्रो द्वारा  निष्पादित किये जाते है .)',
            'मै याद रखूँगा की प्रोद्योगिकी की नींव *विज्ञान* है (, और  मैं उन वैज्ञानिकों का योद्ग्दान  कभी विस्मृत नहीं करूँगा  जिन्होंने इस मेरी इस *कला* को  सहयोग  प्रदान किया है; जिन्होंने गणित , भौतिकी , रसायन -शास्त्र  और गणन -विज्ञान का विकास किया है .)',
            'मै यह कहने में बिलकुल शर्म मह्सून नहीं करूँगा  कि "यह मैं नहीं  जानता"(, न ही मै ज़रूरत पडने पर किसी अन्य अभियंता से सहायता में कोई विलम्ब करूंगा.)',
            'जब मुझे अपनी तकनीक के द्वारा कोई गोपनीय जानकारी मिलेगी , तो मैं उसे *गोपनीय* ही रखूँगा (
			और मैं उस जानकारी का गलत उपयोग नहीं करूंगा .)',
            'मैं सदैव याद रखूँगा की एक अभियंता के रूप में मेरी क्षमता और शक्ति के साथ *दायित्व* भी आते हैं ( जिनसे
			मै मानवता के लिए बेहतर जीवन का *निर्माण * कर सकता हूं .)'
        ),
        I_CC => 'रचनात्मक जन-साधारण अनुज्ञाप्ति',
        I_EPILOGUE0 => 	'यदि मै इस शपथ का उल्लंघन नहीं करता हूं ,
						
						तो मुझे  आजीवन *आदरपूर्वक* *जीवन* और *कला* का आनंद लेने की,
						
						आज्ञा दी जाती है.
                        
						और उसके पश्च्यात मै मै प्रेमपूर्वक याद किया जाऊंगा ',
        I_EPILOGUE1 => 	'मै इस प्रकार से कार्य करूँ की मै अपनी इस विधा की *बेहतरीन परम्पराओं* की रक्षा कर सकूं
        
						और मैं दीर्घ काल तक *नवपरिवर्तन* का आनंद अनुभव कर सकूँ.
                        
						और मैं अपनी कला में योगदान करने के *आनंद* का अनुभव कर सकूँ.
                        
						नवीन तत्वों को इसमें समावेशित कर इसका *विकास* कर सकूं.',
        I_TAKE      => 'मै शपथ लेता हूं ',
        I_SHARE_FB  => 'फसबुक पर साझा करें ',
        I_SHARE_TW  => 'ट्विटर पर साझा करें '
    );
?>
