<?php
    return array(
        I_TITLE => 'Присяга',
        I_SWEAR => 'Я клянусь',
        I_INTRO => 'быть верным в соотвествии с моими лучшими
        
                    *возможностями* и *суждениями*,
                    
                    этой присяге и этим заветам',
        I_OATH  => array(
            'Я буду уважать *знания* людей, по чьим стопам я иду (и тех, кто учит меня и помогает мне, и с радостью делить эти знания с теми, кто следует по моим стопам, как другие делились со мной. Я буду помнить, что
            *знания нельзя скрывать* от тех, кто хочет учиться.)',
            'Я буду использовать технику для *блага* (и для *прогресса* свободного ото зла человечества, 
            для улучшения жизни народов.)',
            'Я не буду извлекать нечестную выгоду из моих знаний(, финансовую, либо любую другую. Я не стану заявлять, что техника
            нужна, если она на самом деле не нужна; я скажу так лишь если она *действительно* решает проблемы, не допуская умышленной несправедливости.)',
            'Я буду помнить, что техника всегда *улучшает*( и никогда не перестану учиться, и целью моей жизни
            будет постоянное *самосовершенствование*.)',
            'Я буду помнить, что в программировании помимо техники есть ещё и искусство (, и что в коде есть красота. Я
            не забуду, что программы должны быть написаны для *людей*, и лишь между прочим для того, чтобы запускаться на машинах.)',
            'Я буду помнить, что основы техники лежат в *науке*( и не забуду вклад учёных, чей труд поддерживает
            мои творения, тех, кто развивал математику, физику, химию и вычислительную науку.)',
            'Мне не будет стыдно сказать "Я не знаю"(, и не стану уклоняться от обращения за помощью к другому разработчику, если она требуется.)',
            'Если при помощи техники я получу доступ к личным данным, я буду уважать *конфиденциальность*
            ( и не стану злоупотреблять этой информацией.)',
            'Я буду помнить, как инженер, что вместе с моими возможностями и силами приходят *обязанности*
            ( *создавать* и делать жизнь людей, моих собратьев, лучше.)'
        ),
        I_CC => 'Лицензия Creative Commons',
        I_EPILOGUE0 => 'Пусть, если я не нарушу эту присягу,
        
                        мне даруются удовольствия от *жизни* и *искусства*,
                        
                        я буду пользоваться *уважением* при жизни
                        
                        и *почитанием* после.',
        I_EPILOGUE1 => 'Да буду я сохранять *лучшие традиции* моего призвания,
        
                        получая удовольствие от *инноваций*.
                        
                        И да буду я *радоваться*, привнося в моё искусство
                        
                        новые элементы, *развивая* его.',
        I_TAKE      => 'Принять присягу',
        I_SHARE_FB  => 'Поделиться на Фейсбуке',
        I_SHARE_TW  => 'Поделиться в Твиттере'
    );
?>
